Для чего нужен язык программирования С?
Создатель С++ Бьярне Страуструп выделяет следующие сферы применения любого языка программирования:
1.	Инструмент для инструктирования машин.
2.	Способ записи алгоритмов.
3.	Средство общения программистов.
4.	Инструмент для экспериментирования.
5.	Средство управления компьютеризированными устройствами.
6.	Способ выражения отношения между концепциями.
7.	Средство выражения проектных решений высокого уровня.
Он упоминает, что язык программирования сочетает в себе все указанные свойства, 
но главное его предназначение – это создание качественного программного обеспечения.
Каждый язык программирования так или иначе специализирован. Данная специализация была 
произведена при создании и стандартизации каждого языка программирования. То есть либо 
создатель языка, либо коллектив разработчиков, либо некоторый комитет по стандартизации 
определил конкретную предметную область, которой призван служить каждый язык программирования.
Наличие специализации вовсе не предполагает, что некоторый язык программирования не пригоден 
ни для чего остального, просто он менее пригоден для этих целей, чем другие специализированные языка программирования.

Язык программирования С обычно называют высокоуровневым аллемблером.
Этот язык разработал Денис Ричи в 1972, будучи сотрудником Bell Labs.
Он является развитием языка B и предназначался для обеспечения удобства разработки
Операционной системы Unix, но со временем его лаконичность и эффективность позволили перенести его на 
множество платформ.
Сегодня С используется повсеместно: от приложений для персональных компьютеров дл встраиваемых систем и суперкомпьютеров.
Более того, до сих пор распространено мнение, что язык встриваемых систем - это в первую очередь именно язык С.
Несмотря на развитие и распространение таких довольно популярных потомков как С++, Java, C#, язык С по прежнему 
играет важную роль в проектировании и разработки компьютерных программ.
С - это компилируемый высокоуровневый язык общего назначения со строго типизацией и слабой проверкой типов.
Его руководящее предназначение - системное программирование, хотя он хорош и эффективен во всем другом.
Тем не менее программисты считают, "С" слишком сложен в использовании, так как предоставляет мало гарантий 
разработчикам приложений, потому для систем, где нет критической нужды в эффективности используются другие высокоуровневые языка
программирования.

Язык С первоначально систематично описан в книге Брайана Кернигана и Дениса Ритчи «Язык программирования Си», которая 
на долгое время стала стандартом данного языка.

K&R ввели следующие особенности языка:
1. struct 
2. long int
3. unsigned int
4. operator +=

После публикации книги в язык были добавлены такие особенности:
1. Фнукции типа void
2. Функции, возвращающие структуры
3. Имена полей данных структур в разных пространствах имен для данной структуры
4. Присваивание структур
5. const
6. std lib
7. enum
8. float

Прошел три стандартизации:
1. С89
2. С99
3. С11

Основан на следующиъ принципах:
1. Простая языковая база, из которой вынесены в библиотеки многие существенные возможности, 
вроде математических функций или функций управления файлами;
2. Ориентация на процедурное программирование, обеспечивающая
удобство применения структурного стиля программирования;
3. Система типов, предохраняющая от бессмысленных операций;
4. Использование препроцессора для, например, определения макросов и включения файлов с исходным кодом;
5. Непосредственный доступ к памяти компьютера через использование указателей;
6. Минимальное число ключевых слов;
7. Передачу параметров в функцию по значению, а не по ссылке (при этом передача по ссылке эмулируется с помощью указателей);
8. Указатели на функции и статические переменные;
9. области действия имён;
10.Структуры и объединения — определяемые пользователем собирательные типы данных,
 которыми можно манипулировать как одним целым;
11. Средства объектно-ориентированного программирования;

Сила языка С, также как и языка С++ в его пользовательских библиотеках, которые позволили ему вырасти из
языка операционной системы UNIX в высокоуровневый язык общего назначения, при сохранении тех же синтаксических и семантических
конструкций.





