#include <std_lib_facilities.h>
//............................ Точка входа
int main () 
{
//............................ Объявление переменных: s - единица, образующая вектор, x - единица вывода для суммирования, sum - результат суммирования вектора, i - нумерация элементов вектора.

double s = 1;
double x = 1;
double sum =1;
double i = 1;

//............................ Объявление нулевого вектора
vector <double> rass;
//............................ Увеличение вектора

for (double s; cin >> s;)
rass.push_back (s);

//............................ Выводим размер вектора и инкрементируем номера его элементов
cout << "size = " << rass.size ();
while (i<rass.size())
{++i;}


//............................ Выводим и суммируем элементы вектора

for (double x : rass) sum+=x;
//............................ Сортировка вектора
sort (rass);
//............................ Вывод суммы вектора
cout	<< "\nSum distanse" 
	<< "\n"
	<< sum-1
	<< "\n";
//............................ Вывод меньшего и большего значений
cout << "min = " << rass [0];
cout << "\nmax = " << rass [i-1] << "\n";
//............................ Вывод средних значений
cout << "Srednee rass = " << (sum-1)/rass.size() << "\n";
//............................ Держать окно открытым
keep_window_open ();
return 0;
}

