/*
Antonuyk I.V.
26/04/2018

N.Novgorond

PPP C++

ex. 25.16

*/


1. RAII это просто.
2. Операторы окружаются пробелами
3. Все имена должны быть осмысленными
4. typename, а не class
5. loop while(true) - break должен предусматривать индикаторы ухода в бесконечность
6. Разделители в стиле комментария между блоками
7. Класс открывается разделом данных
8. По умолчанию использовать бинарный ввод и вывод
9. Тестирование осуществляется несколькими прогонами в одной функции
10. Консольный вывод должен быть осмысленным
11. Во вводном комментарии должно указываться имя файла и некоторые дополнительные данные
12. Использование new и delete не допускается
13. Все данные класса должны инициализироваться в конструкторе