#include <std_lib_facilities.h>

int main ()
{
	setlocale(0,"Russian");
	cout << setw(35) << "Труфанов Максим Владимирович" 	<< "|\t" 	<< setw(19)	<< "Университет" <<"|\n";
	cout << setw(35) << "Николаева Татьяна Владимировна"<< "|\t" 	<< setw(19)	<< "Через друзей" <<"|\n";
	cout << setw(35) << "Черемиссин Александр Олегович" << "|\t"	<< setw(19)	<< "Работа" <<"|\n";
	cout << setw(35) << "Черкашина Ольга Викторовна" 	<< "|\t"	<< setw(19)	<< "Работа" <<"|\n";
	cout << setw(35) << "Антонюк Евгений Валериевич"	<< "|\t" 	<< setw(-1)	<< "Чуть после рождения" <<"|\n";

	keep_window_open();
}